writeups/htb/challenges/web/emdee-five-for-life.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emdee Five for Life</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emdee Five for Life</h1>
<p>
In this challenge we are presented with a webpage that has a string that should
be hashed using MD5 and then submitted.
</p>

<p>
When we test manually, and submit the MD5 hash, we are presented with the same
screen with an extra string saying <code>Too slow!</code>.
</p>

<p>
I guess we can always write a script to submit the hash as fast as we can.
So we can write a Bash Script like this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #7c6f64;">#</span><span style="color: #7c6f64;">!/bin/</span><span style="color: #fb4933;">sh</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">We get the first string to hash</span>
<span style="color: #83a598;">FIRSTHASH</span>=$(curl-s http://209.97.138.240:32106/ | xmllint --html --format --xpath <span style="color: #b8bb26;">"//h3/text()"</span> - 2&gt; /dev/null)

<span style="color: #fb4933;">while </span><span style="color: #fe8019;">true</span>
<span style="color: #fb4933;">do</span>
        <span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">we hash the string</span>
        <span style="color: #83a598;">MD5</span>=$(md5str $<span style="color: #83a598;">FIRSTHASH</span>)
        <span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">we execute CURL and save XML</span>
        <span style="color: #83a598;">XML</span>=$(curl-X POST --data <span style="color: #b8bb26;">"hash=$MD5"</span> http://209.97.138.240:32106/)
        <span style="color: #fe8019;">echo</span> $<span style="color: #83a598;">XML</span>

        <span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">we get a new string to hash for the next iteration</span>
        <span style="color: #83a598;">FIRSTHASH</span>=$(<span style="color: #fe8019;">echo</span> $<span style="color: #83a598;">XML</span> | xmllint --html --format --xpath <span style="color: #b8bb26;">"//h3/text()"</span> - 2&gt; /dev/null)
<span style="color: #fb4933;">done</span>
</pre>
</div>

<p>
The <code>md5str</code> is a script of mine also:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #7c6f64;">#</span><span style="color: #7c6f64;">!/bin/</span><span style="color: #fb4933;">sh</span>
<span style="color: #fe8019;">echo</span> -n $<span style="color: #83a598;">1</span> | md5sum | awk <span style="color: #b8bb26;">'{print $1}'</span>
</pre>
</div>

<p>
The script could be better, but it does the job.
When we run the script, we can see the output of the XML being echoed into the
terminal.
</p>

<p>
For some reason, it still has the same string <code>Too slow!</code>.
</p>

<p>
Could it be the script that is actually very slow? Does this challenge need 1GBit internet
to be solved?
</p>

<p>
Well, if we look up closely after doing a request to the website in the browser,
we can see that there is a session Cookie being used called <code>PHPSESSID</code> that is
always different when we do the request through cURL. So the trick here is to
actually use the same cookie value.
</p>

<p>
We can change the script to accomodate this needed change:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #7c6f64;">#</span><span style="color: #7c6f64;">!/bin/</span><span style="color: #fb4933;">sh</span>

<span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">we added --cookie-jar cookies to save cookies to file called `cookies`</span>
<span style="color: #83a598;">FIRSTHASH</span>=$(curl --cookie-jar cookies -s http://209.97.138.240:32106/ | xmllint --html --format --xpath <span style="color: #b8bb26;">"//h3/text()"</span> - 2&gt; /dev/null)

<span style="color: #fb4933;">while </span><span style="color: #fe8019;">true</span>
<span style="color: #fb4933;">do</span>
        <span style="color: #83a598;">MD5</span>=$(md5str $<span style="color: #83a598;">FIRSTHASH</span>)
        <span style="color: #7c6f64;"># </span><span style="color: #7c6f64;">we load the `cookies` file here</span>
        <span style="color: #83a598;">XML</span>=$(curl -b cookies -X POST --data <span style="color: #b8bb26;">"hash=$MD5"</span> http://209.97.138.240:32106/)
        <span style="color: #7c6f64;">#</span><span style="color: #7c6f64;">echo $MD5</span>
        <span style="color: #fe8019;">echo</span> $<span style="color: #83a598;">XML</span>

        <span style="color: #83a598;">FIRSTHASH</span>=$(<span style="color: #fe8019;">echo</span> $<span style="color: #83a598;">XML</span> | xmllint --html --format --xpath <span style="color: #b8bb26;">"//h3/text()"</span> - 2&gt; /dev/null)
<span style="color: #fb4933;">done</span>
</pre>
</div>

<p>
Now we just run the script again and the flag will appear instead of the usual text <code>Too slow!</code>.
</p>

<hr>
<footer>
<p class="footer_right">16-01-2021</p>
<p><a class="footer" href="/index.html">Homepage</a></p>
<p><a class="footer" href="/writeups/htb/index.html">Back</a></p>
<div style="clear: both;"></div>
</footer>
</div>
</body>
</html>
